Revit 2026 API

# AnalysisResultSchema(AnalysisResultSchema) Constructor

---

Constructs a new copy of the input AnalysisResultSchema object.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AnalysisResultSchema(
	AnalysisResultSchema other
)
```
```vb
Public Sub New (
	other As AnalysisResultSchema
)
```
```cpp
public:
AnalysisResultSchema(
	AnalysisResultSchema^ other
)
```
```fsharp
new :
        other : AnalysisResultSchema -> AnalysisResultSchema
```

#### Parameters

other AnalysisResultSchema

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalysisResultSchema Class

AnalysisResultSchema Overload

Autodesk.Revit.DB.Analysis Namespace